Revit 2026 API

# EnergyAnalysisDetailModelOptionsTier Property

---

Level of computation for energy analysis model.

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public EnergyAnalysisDetailModelTier Tier { get; set; }
```
```vb
Public Property Tier As EnergyAnalysisDetailModelTier
	Get
	Set
```
```cpp
public:
property EnergyAnalysisDetailModelTier Tier {
	EnergyAnalysisDetailModelTier get ();
	void set (EnergyAnalysisDetailModelTier value);
}
```
```fsharp
member Tier : EnergyAnalysisDetailModelTier with get, set
```

#### Property Value

EnergyAnalysisDetailModelTier

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

The default value is EnergyAnalysisModelTier::Final.

#### Reference

EnergyAnalysisDetailModelOptions Class

Autodesk.Revit.DB.Analysis Namespace